# NewFascia Method (FasciaType, Reference) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..NewFascia Method (FasciaType, Reference)
Document Class See Also
---
Creates a fascia along a reference.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Fascia NewFascia(
	FasciaType FasciaType,
	Reference reference
)
```

Visual Basic
---
```text
Public Function NewFascia ( _
	FasciaType As FasciaType, _
	reference As Reference _
) As Fascia
```

Visual C++
---
```text
public:
Fascia^ NewFascia(
	FasciaType^ FasciaType,
	Reference^ reference
)
```

# ### Parameters
FasciaType
    Type: Autodesk.Revit.DB.Architecture..::..FasciaType The type of the fascia to create
reference
    Type: Autodesk.Revit.DB..::..Reference A planar line or arc that represents the place where you want to place the fascia.
# ### Return Value
If successful a new fascia object within the project, otherwise nullNothingnullptra null reference (Nothing in Visual Basic).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if the fascia type does not exist in the given document. |

# See Also
Document Class
NewFascia Overload
Autodesk.Revit.Creation Namespace